"[{\"name\":\"Buddy Hoagies Steak & Grill Restaurant (Rendezvous Hotel Singapore )\",\"reviews\":[{\"rating\":5,\"text\":\"Food portion is HUGE!! Super worth it! We tried all the various dishes from Staters to main. (No room for dessert) I can tell you it is consistent and well cook. It was truly enjoyable.\\n\\nSeating is well spaced out, Waiter and Waitress comes by often to check in on us \\ud83d\\udc4d\\n\\nService drops 1 star because this is yet another restaurant that you self help the ordering by scanning the QR code. Nevertheless, the App \\/ Web Page is very well done.\"},{\"rating\":5,\"text\":\"Visited the western restaurant a few times for a meal. The restaurant is quite spacious and the service staff is quite friendly too. The ordering system is quite efficient as ordering and payment is done through the QR code at the table. The food portion is quite decent as well. Overall, a good dining experience especially during lunch promotions.\"},{\"rating\":5,\"text\":\"It was a weekend family lunch to celebrate my son's birthday.  W\\nFor the family of 4 adults, we ordered the restaurant's family platter. It was amazing! From juicy steaks to tasty meats, crispy fries, and flavorful veggies, it was a feast of deliciousness. Each element on the platter showcased exceptional flavors and quality, leaving our taste buds thoroughly satisfied.\\n\\nThe restaurant manager's service was impeccable! He always appeared at just the right moment, ensuring we had an enjoyable meal. His attentiveness made our dining experience truly exceptional\\n\\nA special mention goes to the restaurant staff for their thoughtful gesture: a complimentary cheesecake, topped with ice cream, for the birthday boy. It added a sweet touch to our meal and made the celebration even more memorable.\"},{\"rating\":5,\"text\":\"Ordered the BBQ Chicken set.\\n\\nFood was well cooked. Meat was tasty. Soup was delicious. Even the garlic bread is a well spread, soft and sweet bread.\\n\\nEven the hot veggies had a nice touch of garlic butter.\\n\\nStaff was friendly.\\n\\nPrice is just slightly higher than usual for meals at a similar setting. But overall, still a great experience.\"},{\"rating\":5,\"text\":\"Best place I've gone to. Foods are delicious. Service is great and place is inviting. Highly recommended if you are a tourist who looks for something good to eat.\"}],\"serves_vegetarian_food\":\"False\"},{\"name\":\"Les Amis\",\"reviews\":[{\"rating\":5,\"text\":\"Celebrated my birthday at Les Amis with family, and it was phenomenal! The upscale ambiance and impeccable service set the stage for a memorable evening. Each dish was a masterpiece, showcasing culinary expertise. From appetizers to desserts, a gastronomic delight that made my special day truly exceptional. Highly recommend!\"},{\"rating\":4,\"text\":\"Good experience to celebrate our anniversary at a 3\\u2b50\\ufe0f Michelin restaurant. Great service with good food and wine.\\n\\nWith my limited exposure to French cuisine, I might not have fully appreciated the taste. But I really enjoyed the overall experience there.\\n\\nA memorable night.\"},{\"rating\":4,\"text\":\"The person who seemed to be the manager who welcomed us for the first time was quite rude. (He is not Asian)\\nI couldn\\u2019t understand this restaurant got 3 stars of Michelin because of him.\\nOther staffs are friendly and have good manner.\\nFood was good actually.\"},{\"rating\":5,\"text\":\"Les Amis restaurant is a gastronomic wonderland that transported me to a world of culinary bliss! The ambiance felt like a page out of a Parisian romance novel, with soft lights and a melody of enchanting tunes. The menu, a poetic composition of flavors, offered a dance of taste that left me in awe. The waitstaff, dressed in elegant attire, choreographed a dining experience that was nothing short of a culinary ballet. Each dish, a masterpiece plated with precision, tasted like a symphony of harmonious ingredients. If you're yearning for a dining escapade that feels like a rendezvous with gourmet dreams, Les Amis is the destination to indulge your palate in a poetic feast!\"},{\"rating\":4,\"text\":\"I would say the food is generally par to a 2 Michelin stars. The chef is generous with the caviar portion. For the wine pairing, I was expecting a bit more of the wine explanation about the region, weather, expected taste. However the sommelier did not do that. In terms of the service team, they are excellent especially a middle age man who originally from Johor. (Forgot your name!) this time, I was in the chef table which I would say is the best seat where you get a quiet and private place.\"}],\"serves_vegetarian_food\":\"False\"},{\"name\":\"Two Chefs Eating Place\",\"reviews\":[{\"rating\":3,\"text\":\"Visit there purely for their drunken cockles coz we visited commonwealth long time ago and miss this signature dish so much.\\nYet, quite shock when see it\\u2019s serve in a transparent takeaway box.  Cockles are big, and price at $8 for 15pcs considered reasonable, only if the curing process can be more thoroughly. Now is like merely cockle coating with dressing.\\nThe girl who take our order told us sin chew behoon portion is very small hence we order another Hong Kong dried noodle. End up looks like those vege dish is small but those noodles are not.\\n\\nOne thing with the setting of the coffee shop, honestly speaking we notices that it\\u2019s hard to attract service staff\\u2019s notice to take order at table by just raising up hand. its will be faster by going to the counter and make order yourself.\"},{\"rating\":5,\"text\":\"XO San Lou Hor Fun was SO SHIOK!! Can really taste the wok hei and had generous amount of fish slices. Must also order the Fried Yam omg damn well fried and coated evenly, those who love yam will definitely love it! Pork Rib was so so only.\"},{\"rating\":3,\"text\":\"Food was definitely precooked because it arrived 3-5 mins after we ordered. The texture is soso, but the taste was decent especially the milk powder pork ribs.\"},{\"rating\":5,\"text\":\"This is an economical place for big groups. Table here comfortably sits 12 pax. Has big fans, keeps the place very windy and cool. Food is not bad, and price is good. Have been here twice and both times had their set with a few add ons. If in a big group, this is a place to consider.\"},{\"rating\":5,\"text\":\"Is always my family favorite place ! Food is never disappointed ! Though is just a eating house bit the service is good ! The boss, Ah Siong and the crew are always attentive.  Valued for money fir good food ! Highly recommended \\u2764\\ufe0f\"}],\"serves_vegetarian_food\":\"False\"},{\"name\":\"Bar-A-Thym Restaurant by Francois Mermilliod\",\"reviews\":[{\"rating\":5,\"text\":\"A true taste of France, combining authentic flavors, attentive service, and a charming ambiance. It\\u2019s a culinary gem for those seeking a refined and memorable dining experience.\\nService was impeccable, Jerriek, a great restaurant manager who is really friendly.\\nI look forward to returning to indulge in more of their delectable offerings.\"},{\"rating\":5,\"text\":\"Celebrated my husband birthday here and it went well. All the  foods  we ordered were delicious. Staff are very friendly especially Santos, who provides impeccable service.\\n\\nThank you so much to the whole team for wonderful food and service. We will definitely go back.\"},{\"rating\":5,\"text\":\"The best French restaurant I have experienced in Singapore so far. All the dishes are well cooked and yummy, had a good time together with friends, restaurant manager Jerriek is very attentive and helpful, we lover his service! Highly recommend\"},{\"rating\":5,\"text\":\"Food was impeccable, Santos was very attentive to our needs, cosy ambiance. Best Paris Brest that we\\u2019ve had. Great place for a date or a chill place to hang with your friends. Definitely highly recommended.\"},{\"rating\":5,\"text\":\"Authentic French food with cosy and homey atmosphere. The meal was excellent, from the appetisers to the mains and desserts. Good selection of wines too.\"}],\"serves_vegetarian_food\":true},{\"name\":\"Dragon's Bite by Our Dining Place\",\"reviews\":[{\"rating\":5,\"text\":\"Little nice cozy restaurant in side Ibis hotel. Wanted to try their Signature chicken rice but it\\u2019s only available on Friday, Saturdays and Sunday. Apparently their other signature dish is their fish head curry, not suitable for lunch, but will try it out for dinner next time. We order their 1 for 1 set meal with a variety of options for selection, we tried the salted egg chicken and beans, it comes with free rice and soup for 2. Portion is just nice, price is reasonable for $18.90. Good place for a decent meal if you are working around this area\"},{\"rating\":5,\"text\":\"This place is a gem hiding inside the ibis imperial hotel lobby. The choices of food are not much but what I order taste so good and must come back again to try the rest. The place is very small, maybe I come at off peak hour so easily get a seat. The service is excellent, the staff told me last year they shifted here, perhaps they had relocated far away from the regular customers so I felt that very quiet and not much people. Pricing are very reasonable. I highly recommend, if you like fresh and warm food prepared in cantonese style this is the place. Oh, one more thing they have western food too. Beer price are very affordable too, less than $9 per big bottle. \\ud83d\\ude0d\\ud83d\\udc4d\\ud83c\\udffdYou must try their steam fish, taste better than home cook. \\ud83e\\udd2d\\ud83d\\ude0b\\ud83d\\ude0b\\ud83d\\ude0b\\ud83d\\ude1c\"},{\"rating\":4,\"text\":\"Our second time here. Ordered curry fish head & dried curry pork. Curry fish head is good and the fish head is fresh, same as our first time. Love it that the sauce is not too thick. Just nice.\\nDried curry pork is so so only and I find it lack of some kick, ie they could add more spices to make it more flavourful. All in all, we are happy with the meal and will come back for more.\"},{\"rating\":4,\"text\":\"Home cooked style, small restaurant hidden in Ibis hotel level 1. Pork ribs glazed with salted egg yolk sauce is tender and tasty.\"},{\"rating\":5,\"text\":\"Good food and friendly staff\\nBest restaurant in town, much appreciated\"}],\"serves_vegetarian_food\":\"False\"},{\"name\":\"Selera Restaurant\",\"reviews\":[{\"rating\":5,\"text\":\"First time to eat here as our lodging together with my wife is just on top of this restaurant. All in allme and my wife enjoyed eating here in Selera. The food is tasty esp their lemon chicken rice. A must try in Mackenzie road\"},{\"rating\":5,\"text\":\"Fried chicken rice, mutton curry puff and pisang goreng (deep fried banana) are the longtime highlights here.\\nGoing to keep this record here\\nMutton curry puff - green dot\\nSardine curry puff - red dot\\nChicken curry puff - dotless\\n(The mutton curry puffs here are a serious topic... can find generous chunks of mutton inside each curry puff. The mutton chunks are not outnumbered by the potatoes.)\\nFried chicken has the skin just right, light and crisp. Breast meat is moist and not dry - with crunchy bits near the crisp skin.\\nThe rice can be eaten on its own... There's a lot going on in the rice. Practically a dish on its own.\\nMany ppl order chicken drumstick rice\\nA lot better than many non-halal chicken rice and curry puffs\"},{\"rating\":5,\"text\":\"I have dined here on multiple occasions, and each visit has been enjoyable. The chicken rice, in particular, stands out for its delectable taste and reasonable pricing. The portions of chicken provided are generous. The staff exhibit exceptional friendliness and attentiveness. Beyond the chicken rice, the restaurant offers a diverse array of dishes. I highly recommend paying them a visit!\"},{\"rating\":4,\"text\":\"Here BBQ chicken rice and soup is nice !!!\\nBut !! Tabel and trays are dirty.....A bit scard...\\nSesame bread is nice ! But fried sweet potato is worst.\"},{\"rating\":5,\"text\":\"Have been here a few rimas. Not bad place and food is good. Reasonable priced. If you want a Quick group Lunch at affordable price but quality food. Thisbis the place to go. Try their Pisang Goreng and other fried starters. Highly recommended.\"}],\"serves_vegetarian_food\":\"False\"},{\"name\":\"Bar-Roque Grill\",\"reviews\":[{\"rating\":5,\"text\":\"Awesome staff and food. Brought my partner here for her birthday and the food didn't disappoint. I'm also very happy they provided us a dessert with a candle, it was a nice touch.\"},{\"rating\":5,\"text\":\"Evelyn was an amazing server, she would check on us at regular intervals and if we needed anything. It\\u2019s a joy to be served by her.\\n\\nBeef Wellington here is second to none. Beef is tender, soft to eat, and moist. Puff pastry is light and buttery. Most amazing beef wellington I had period.\\n\\nStarters were good but nothing to rave home about. Caesar Salad was topped with a generous amount of cheese. Sauce felt heavy and thick.\\nJapanese style steak tartare, tastes of soy, mirin marinate. Taste reminiscent of your first tuna poke bowl.\\n\\nGenerally it\\u2019s an amazing and enjoyable place to dine at. The wine selection is wide. :)\"},{\"rating\":5,\"text\":\"Awesome dry-aged beef platter! The tenderness was perfect and must go for their spinach mushroom and truffle mashed potato. Their sourdough bread with butter was awesome as well and really addictive. For non-beef eaters, do go for their tuna fillet as it was awesomely delicious with their curry tasting sauce. Love the friendliness of all staff and ambience.\"},{\"rating\":5,\"text\":\"lovely and attentive service staff! really enjoyed the beef wellington, pastry was fragrant and beef was tender. the ribeye was lovely, not tough at all and medium rare like we requested. sides (gratin and brussel sprouts) were well executed too. would def come back for special occasions (:\"},{\"rating\":4,\"text\":\"great food. the steak was reasonably priced but the sides of mushroom and spinach was towards the salty side. the yellow fin tuna tatare was great. overall still a nice experience. they gave us free desserts for our mini anniversary celebration:)\"}],\"serves_vegetarian_food\":true},{\"name\":\"Baci Baci Restaurant\",\"reviews\":[{\"rating\":4,\"text\":\"Food was great and everything. However, there was one incident that when the waiter lifted the plate to clear, the plate was tilted and happen to spilled some sauce onto my partner's jeans. He merely muttered a sorry and left. I understand that he's just doing his job and don't want to be difficult. But just highlighting this so that they're more careful next time.\"},{\"rating\":5,\"text\":\"I'm writing this as i eat. Been few years since my last visit & OMG! Vividly remember it's nice place for good Italian food but this visit really blew my mind. Hardly hardly a fine dining place but as a casual restaurante it hits all what it suppose to have, best experience by far in for Italian joint. Don't wish to use the 'out of the world' expression but kinda almost there & it's just a casual Friday nite dinner. Hope it stays on & keep up the good services\\ud83d\\ude4f\\ud83d\\ude4f\"},{\"rating\":5,\"text\":\"Came earlier for better chance of parking at the landed estate. Thoroughly enjoyed the food here! Had the Fig Time pizza, rock melon with parma ham and angel hair pasta w\\/ king crab meat. Will come back and try other dishes on the menu (:\"},{\"rating\":5,\"text\":\"Visited Baci Baci and Love the place! Had the Cioppino and Seabass with my friend, and the seafood was simply fresh and tasty! The seabass was tender and juicy. Would definitely have it again!\\n\\nThe tables can be a little more space apart as the noise level from the other tables was a little loud. But the service from the staff more than made up for it. They were friendly and attentive to our needs and were present when needed.\"},{\"rating\":5,\"text\":\"Another find in Serangoon gardens and Another Italian favourite of mine. Quite hidden. We had to park car and walk a while to get here. The ambience was cosy and the service was prompt. I loved their pizza! All dishes we ordered were lovely. The pastas were fresh. Truffle pasta was decadent.\"}],\"serves_vegetarian_food\":true},{\"name\":\"roots@onenorth restaurant\",\"reviews\":[{\"rating\":5,\"text\":\"Roots located at one-north is at an annex location. It is a small, cosy western restaurant that serves wonderful set meals, tomahawk (order in advance) and alcoholic drinks. It is convenient and a walk away from one-north MRT. It is at road-level and by a small road. Nice quiet place during weekends or holidays.\"},{\"rating\":5,\"text\":\"Cozy place. Not many people when I arrived. The staff was immediate to provide service when I arrived. Ordered lamb racks menu set that came with a soft drink and soup.\\n\\nThe tomato soup was served hot and decent seasoning. A bit on the sweeter side but had tomato chunks.\\n\\nLamb racks had a nice char on them and didn\\u2019t lack in flavour. They were also very juicy and tender, definitely a very good cut of meat. You can tell the chef put in his heart to make them.\\n\\nFor the price, the quality and overall experience is highly recommended. I will recommend to order just the ala-carte mains, as the other dishes were so-so only.\"},{\"rating\":5,\"text\":\"Tried the set meal. Happy, good food good value.\\nThe tomahawk steak is awesome as well.\"},{\"rating\":5,\"text\":\"We simply love our orders  from the appetizers, soup , main dishes and the dessert. . The food and service at roots@onenorth  is excellent!  Tomahawk is one of my fave but i would suggest  pre order is advised.  Mushroom and the tomatoes soup are one of the best I have tried before. The tuna appetizer is a must try !\"},{\"rating\":5,\"text\":\"Great service rendered by the friendly staff, cosy ambience, food was magnificient with wide selection and I definitely recommend this place to chill and unwind after work or during the weekends. If you are a Cr\\u00e8me Br\\u016dlee fan, please try, it's out of this world. So creamy, smooth and delicious. 2 thumbs up and I'll be back ...!!\"}],\"serves_vegetarian_food\":true},{\"name\":\"Claudine Restaurant\",\"reviews\":[{\"rating\":4,\"text\":\"Unique restaurant indeed. We are dining in the chapel and drinking at bar under the leaded glass window at the dark of the night. So yeah, whatever suits you, it is unusual but  also the venue was nicely done. It is very dimmed and atmospheric (no, it is not Halloween kind).\\n\\nThe service was lovely - it was warm, friendly, prompt  and every proper. In comparison to restaurants in its class,  Claudine shone that night.\\n\\nThe menu changes every now and then. Although I could not get the uni pasta, the food did not disappoint. The menu was short but well-thought of. The wine offering was appropriate for the food. and the cocktails were  tasty and well-balanced. This restaurant may well be slightly pricier than their peer across the street but each has their unique point.\\n\\nWe were happy with the experience and would love to come back.\"},{\"rating\":5,\"text\":\"Took the day off to celebrate my wife\\u2019s birthday and decided to have lunch together at Claudine as a special treat.\\n\\nThe food was simply amazing and the service was attentive without being intrusive. We loved how they have leveraged on the high ceiling of the old chapel and installed a work of art to light up the dining room.\\n\\nThe meal certainly didn\\u2019t come cheap but it\\u2019s definitely a place worth visiting for a special occasion.\"},{\"rating\":4,\"text\":\"Food was very good in general but not unforgettable. Service was very good. Chef asked how was the food ONLY for  regular customers. The reservation form asked for any special event where we mentioned, a birthday. But no cake was offered, I have been to less pricey place where they give a small cake complimentariraly. Expected more for this price range.\"},{\"rating\":4,\"text\":\"We have afternoon snacks at the La Petite Terrace, it\\u2019s part of claudine restaurant that open at 5PM from Tue-Sunday.\\n\\nThe red truck is pretty and iconic, they serve some cocktails, wine and canape that can be ordered from the trucks.\\nBut we also allowed to order from inside.\\nOverall all the canapes are delicious and the drinks was ok.\"},{\"rating\":5,\"text\":\"My wife and I celebrated our wedding anniversary there and it was the perfect place for a special occasion. The staff were attentive and friendly from the start, asking if we had dietary restrictions - which then flowed seamlessly into the food recommendations and even the butter provided for the delicious rye bread. We had the Caramelised Onion Tart, Pacific Black Cod, Brown Mushrooms & Morsels Ravioli, and 'Exotic Gourmandaise', accompanied by a carafe of Riesling that was smooth and dry.\\n\\nEvery dish was exquisite and delicious, combining the appropriate blend of flavours. The 'Exotic Gourmandaise' was one of the best desserts we ever had - the orange was refreshing and the coriander sauce was the perfect complement to the brightness and sweetness of the dish. Thank you for a wonderful experience! We loved everything and will be back!\"}],\"serves_vegetarian_food\":true},{\"name\":\"Enjoy Eating House and Bar\",\"reviews\":[{\"rating\":5,\"text\":\"This place serves the most legit rendition of local food.\\n\\nThey do two things really well - their stock, and how they infuse them onto the food. You can see they don't scrimp on their ingredients, with how every sauce and soup being so concentrated.\\n\\nHere's our favourites:\\n\\nServed sizzling hot, \\ud835\\udc07\\ud835\\udc1a\\ud835\\udc24\\ud835\\udc24\\ud835\\udc1a \\ud835\\udc11\\ud835\\udc1e\\ud835\\udc1d \\ud835\\udc11\\ud835\\udc22\\ud835\\udc1c\\ud835\\udc1e \\ud835\\udc16\\ud835\\udc22\\ud835\\udc27\\ud835\\udc1e \\ud835\\udc02\\ud835\\udc21\\ud835\\udc22\\ud835\\udc1c\\ud835\\udc24\\ud835\\udc1e\\ud835\\udc27 had such a robust savoury soup base, with smokiness and hint of brandy coming through. The chicken had also been thoroughly infused with the base. Really really good!\\n\\n\\ud835\\udc06\\ud835\\udc2b\\ud835\\udc1a\\ud835\\udc27\\ud835\\udc1d\\ud835\\udc26\\ud835\\udc1a'\\ud835\\udc2c \\ud835\\udc13\\ud835\\udc1e \\ud835\\udc0a\\ud835\\udc1a\\ud835\\udc21 \\ud835\\udc01\\ud835\\udc1e\\ud835\\udc1e \\ud835\\udc07\\ud835\\udc28\\ud835\\udc28\\ud835\\udc27 taste like it's name, it felt like your grandma's love on a plate. It has that rustic traditional taste, very flavourful and again, infused with taste of braised pork trotter.\\n\\nThe \\ud835\\udc07\\ud835\\udc1a\\ud835\\udc22\\ud835\\udc27\\ud835\\udc1a\\ud835\\udc27\\ud835\\udc1e\\ud835\\udc2c\\ud835\\udc1e \\ud835\\udc0b\\ud835\\udc1a\\ud835\\udc26\\ud835\\udc1b \\ud835\\udc12\\ud835\\udc2d\\ud835\\udc1e\\ud835\\udc30 is so concentrated, yet somehow retain only the pleasant-side of lamb gameyness. Good bite and tender throughout.\\n\\nWe also tried the \\ud835\\udc07\\ud835\\udc1a\\ud835\\udc22\\ud835\\udc27\\ud835\\udc1a\\ud835\\udc27\\ud835\\udc1e\\ud835\\udc2c\\ud835\\udc1e \\ud835\\udc02\\ud835\\udc21\\ud835\\udc22\\ud835\\udc1c\\ud835\\udc24\\ud835\\udc1e\\ud835\\udc27 \\ud835\\udc12\\ud835\\udc1a\\ud835\\udc2d\\ud835\\udc1a\\ud835\\udc32, \\ud835\\udc14\\ud835\\udc20\\ud835\\udc25\\ud835\\udc32 \\ud835\\udc02\\ud835\\udc1a\\ud835\\udc1b\\ud835\\udc1b\\ud835\\udc1a\\ud835\\udc20\\ud835\\udc1e \\ud835\\udc22\\ud835\\udc27 \\ud835\\udc05\\ud835\\udc22\\ud835\\udc2c\\ud835\\udc21 \\ud835\\udc12\\ud835\\udc1a\\ud835\\udc2e\\ud835\\udc1c\\ud835\\udc1e, \\ud835\\udc02\\ud835\\udc21\\ud835\\udc1e\\ud835\\udc1f \\ud835\\udc09\\ud835\\udc28\\ud835\\udc1e\\ud835\\udc25'\\ud835\\udc2c \\ud835\\udc01\\ud835\\udc01\\ud835\\udc10 \\ud835\\udc0f\\ud835\\udc28\\ud835\\udc2b\\ud835\\udc24 \\ud835\\udc02\\ud835\\udc21\\ud835\\udc1e\\ud835\\udc1e\\ud835\\udc24, \\ud835\\udc0f\\ud835\\udc28\\ud835\\udc29\\ud835\\udc22\\ud835\\udc1a\\ud835\\udc21 \\ud835\\udc06\\ud835\\udc1a\\ud835\\udc2b\\ud835\\udc1d\\ud835\\udc1e\\ud835\\udc27, all of which were decent and worth a try. The only miss (a mild one) was the \\ud835\\udc02\\ud835\\udc2b\\ud835\\udc1a\\ud835\\udc1b \\ud835\\udc0c\\ud835\\udc1e\\ud835\\udc1a\\ud835\\udc2d \\ud835\\udc0e\\ud835\\udc26\\ud835\\udc1e\\ud835\\udc25\\ud835\\udc1e\\ud835\\udc2d\\ud835\\udc2d\\ud835\\udc1e, which we felt was rather ordinary.\\n\\nIf you still have space for dessert, you need to try the \\ud835\\udc02\\ud835\\udc21\\ud835\\udc1e\\ud835\\udc27\\ud835\\udc1d\\ud835\\udc28\\ud835\\udc25 \\ud835\\udc0f\\ud835\\udc1a\\ud835\\udc27\\ud835\\udc27\\ud835\\udc1a \\ud835\\udc02\\ud835\\udc28\\ud835\\udc2d\\ud835\\udc2d\\ud835\\udc1a. They elevated the local favourite with the use of panna cotta, drenched in thick fragrant gula melala.\"},{\"rating\":5,\"text\":\"This place serves zi char with a premium and unique twist that will bring a smile even to the fussiest of parents. Their outlet at Stevens Road features a vibrant yet cozy atmosphere, adding bonus points to the meal. I tried the following dishes:\\n\\n\\ud83c\\udf57 Har Jeong Kai Wings ($16) \\ud83c\\udf1f\\n\\ud83e\\udd80 Crab Meat Omelette ($18)\\n\\ud83d\\udc1f Fried Barramundi in Chef Joel\\u2019s Red Curry Sauce ($28)\\n\\ud83e\\udd6c Ugly Cabbage in Fish Sauce ($16) \\ud83c\\udf1f\\n\\ud83d\\udc37 Grandma\\u2019s Te Kah Bee Hoon ($17)\\ud83c\\udf1f\\n\\ud83c\\udf60 Teochew Orh Ni ($5)\\n\\nMy top picks are:\\n\\n1\\ufe0f\\u20e3 Ha Jeong Kai wings which were crunchy, well flavoured and juicy. Could tell that they used fresh chicken for this dish!\\n2\\ufe0f\\u20e3 Ugly Cabbage had a full on intense wok hei flavour that honestly blew my mind when I took the first bite. The fish sauce was both salty and sweet, making it a super addictive dish to have.\\n3\\ufe0f\\u20e3 Grandma\\u2019s Te Kah Beehoon is THE dish to impress your parents with. It brings back memories of comfort and warmth with its savoury and deep braised flavour.\\n\\nThis isn\\u2019t my first time at Enjoy Eating House and Bar, and they have always been impressive since day one.\\n\\n\\ud83d\\udc49\\ud83c\\udffc Full video review on my Instagram @littlemissramensg!\"},{\"rating\":5,\"text\":\"looking for a place that serves premium zichar with a unique twist? enjoy eating house is the place to be!!! mums are usually hard to impress but mine had such a good time here, she kept asking how is it that she has never heard of this place \\ud83d\\ude02\\n\\ncrispy fish with chef joel\\u2019s red curry sauce ($49):\\n- super meaty & tender barramundi paired with red nyona-inspired curry that\\u2019s thicker than what you usually find\\n- they were so thoughtful to portion the fish so nicely for us diners!\\n- my mum was singing praises for this dish for how value for money and delicious it was!\\n\\nugly cabbage in fish sauce ($16):\\n- to be honest, this isn\\u2019t something we would have ordered on our own given its price point\\n- but everybody recommended it so we had to get it!\\n- the good smoky aroma went hand in hand with the sweet and crunch cabbage, it would definitely blow the minds of your guests!\\n\\ntinpot prawn tanghoon ($21):\\n- this sauce soaked, aromatic glass noodle tasted so good while it was still hot, we definitely inhaled this!\\n- unfortunately the prawns were overcooked and tasteless, we were quite confused with how it didn\\u2019t absorb any hint of flavour from the broth\\n\\nsupreme seafood fried rice ($19):\\n- it\\u2019s a good bowl of fried rice, but nothing to shout about!\\n\\ncrab meat omelette ($18):\\n- the omelette was fluffy and had a good amount of crab eggs\\n\\nmy only gripe is that many of the items were out of stock during our visit on saturday 2pm, but it also goes to show how popular they are!\"},{\"rating\":5,\"text\":\"All the food were good here!\\nSo we could've resist but to ordering so much for our late-Lunch.\\n\\nEvery mouthful of savoury with quality ingredients and exquisite cooking. Surely with Wokhei!\\n\\nFood Ordered:\\nJumbo Kurobuta & Crab Nhgo Hiong $17\\nCrab Meat Omelette $18\\nKing Kong Bak Pau - 4pc $24\\nCrispy Fish with Chef Joel's Red Curry Sauce Fillet $28\\n2x Ugly Cabbage in Fish Sauce $16\\nHakka Steam Tofu $17\\nChef Joel's BBQ Pork Cheek $22\\nPork Stomach & Rind Dry BKT $22\\n\\nDesserts:\\nChendol Panna Cotta $8\\nTeochew Orh Ni $5\\n\\nAtmosphere:\\nRetrospective with nostalgia decorations\\n\\nService:\\nExcellent Service by the staff, they reverified that we repeat some orders.\\n\\nPrice: $$$\"},{\"rating\":4,\"text\":\"Situated near Novotel on Stevens Road, just a short distance from the lively Orchard area, Enjoy Eating House brings a touch of modernity to premium zi char, offering a contemporary twist on local Singaporean cuisine. Must-try dishes include the Trio Egg Spinach\\u2014fluffy beaten egg and spinach braised in a savoury stock with century eggs, and Chef Joel\\u2019s Pork Cheek\\u2014slices featuring a well-balanced fat-to-meat ratio and a charred exterior, providing a mix of charred and slightly sweet flavours. Given its popularity among regulars, we recommend making reservations in advance!\"}],\"serves_vegetarian_food\":true},{\"name\":\"BAKALAKI Greek Taverna\",\"reviews\":[{\"rating\":5,\"text\":\"Great Greek food served here. Meat patter was tasty and filling. Good spread of seafood. Fish was fresh and the octopus was very well done.\\nDessert and coffee was also uniquely Greek.\"},{\"rating\":5,\"text\":\"This is a surprisingly interesting Greek food restaurant tucked in a posh residential area. I have never had Greek food before and it left me a good impression. Salads are light but tasty enough. Feta cheese is often used and it adds a creamy and interesting flavour to the sauces and dressings.  The Moussaka (eggplant + meat) is delicious. The desserts are also very good. They say they close at 12 AM but it seems that it is slightly earlier.\"},{\"rating\":5,\"text\":\"Great authentic Greek food served here. Seafood patter was tasty and filling. Good spread of seafood. Fish was fresh and the octopus was very well done.\\nDessert and coffee was also uniquely Greek. I\\u2019ll be back to try more dishes\"},{\"rating\":5,\"text\":\"A great place to eat, hangout, and meet up with friends. The food were awesome and the whe team service was superb. I will definitely come back here.\\n\\nHummus is a must order, they made it so good.\"},{\"rating\":5,\"text\":\"We thoroughly enjoyed the toasted bread with olive oil, sea bream with potato salad, lamb chops with roasted potatoes, baklava and mosaiko. We found the portions to be just nice and the food to be of good quality. We like the music, restaurant decor and clean washrooms. Service by MK and another tall non-Chinese gentleman (forgot to get his name) was attentive and cheerful. Happy to celebrate my birthday here. Will be back!\"}],\"serves_vegetarian_food\":\"False\"},{\"name\":\"Bonding Kitchen Orchard Singapore\",\"reviews\":[{\"rating\":5,\"text\":\"I really loved the passion of bringing the best of Peranakan Cuisine. Founder himself is a chef, and has a story worth knowing. Coming from humble grounds, and food turned his life up. And I am sure why food is so great here.\\n\\nWe tried a bunch of things in the menu, 90% of the dishes were great. Please take reservations to avoid waiting. Weekends are usually busy here.\"},{\"rating\":5,\"text\":\"We decided on a set menu for 2pax as it had the dishes we wanted and more value for money.\\n\\nI like Bonding Kitchen's rendition of Nyonya Chap Chye\\u00a0that is cooked in a prawn broth and soybean paste for that sweetness and added umami; and that the cabbage weren't mushy.\\n\\nThe Wagyu Beef Rendang here is a dried version, and packed with fragrant, rich and complex flavours. It was sufficiently lemak and not that spicy, and the beef meat was fork tender. The dish that blew me away was the Sotong Masak Hitam. It was cooked to a perfect tender and texture I've never had before. It was slightly tangy and sweet from the tamarind juice used in this dish.\\n\\nI didn't quite enjoy the Chendol as the jelly was thick and red beans were too big; and it could be richer and sweeter. We also got to try the Gula Melaka Panna Cotta as a birthday \\\"cake\\\" that was wobbly, creamy, silky and melts in the mouth. It was a nice touch with the sweet and sticky gula melaka.\\n\\nOverall a satisfying lunch and the portion size of the dishes were good as well for two or even three ladies.\"},{\"rating\":3,\"text\":\"Food is average.\\nPortion is small and food is not cheap.\\nDishes are generally ok except for dessert.\\nI would recommend u to try Assam fish and petai.\\nChendol is slimy and is weird. Stay away.\"},{\"rating\":5,\"text\":\"Chanced upon this restaurant for my family late lunch. Notice most of the tables had their food served but there was still a long wait for our food. Understand that dishes need to prepare upon ordering but staff could serve dishes that are ready first. Price on the high side vs the portion. Will revisit again as food is indeed tasty.\"},{\"rating\":4,\"text\":\"Went to dine-in for at least 2 times within last year 2023. Finally got to taste their peranakan dishes, becos during covid time, suppose to go & dine-in. Who know, policy changed to 2 diners.\\n\\nTheir signature dish - wagyu rendang is a must to order. Curry ayam dish was the 2nd time visit whereby one of my gf ordered. It was really very creamy & strong curry. Must eat together with their blue butterfly pea rice.\\n\\nPetai is another dish must to order. Not smelly, tasty & crispy to eat.\\n\\nFinally got to order their dessert chendol. It was a good for me. However, one of my friends prefer her pantta cotta \\ud83d\\ude0b\"}],\"serves_vegetarian_food\":\"False\"},{\"name\":\"Tasvee Restaurant\",\"reviews\":[{\"rating\":5,\"text\":\"Fantastic selection and prepared foods.. served hot and fresh.. a must visit for travelers and locals across the globe.\\nI personally can't wait to experience my next meal.. curry for breakfast is never wrong \\ud83d\\ude0b\"},{\"rating\":4,\"text\":\"Had some murtabak, mee goring, egg parathyroid, tandoori chicken and butter chicken here. All dishes were well portioned and were tasty. Good service from the attendants and workers.\"},{\"rating\":3,\"text\":\"This all-vegetarian dish plus a cup of teh ice cost me $9.20.. not sure how but I was definitely shocked. Place was warm as others said, not well ventilated.\"},{\"rating\":5,\"text\":\"Yummy! Definitely one of the nice mamak  in SG. We ordered garlic cheese naan and maggi goreng Ayam (no red sauce).there are two type of maggi goreng one with red sauce one without. We love the one without red sauce. Teh Halia is nice too\\ud83d\\udc4d\\ud83c\\udffb\"},{\"rating\":2,\"text\":\"Quite a bad experience here. First of all, taste is just normal but the texture is bad. Fried chicken was very hard, the squid is very rubbery. Worse still, the squid\\u2019s beak is not removed hence every bite of the squid\\u2019s tentacles will hit your teeth. The only good thing here is the spacious seating and good ventilation. First and last time here.\"}],\"serves_vegetarian_food\":true},{\"name\":\"Ristorante Luka - Tanjong Pagar\",\"reviews\":[{\"rating\":5,\"text\":\"What a lovely place and friendly people! Definitely going back! First of all, we got the best seats ever - directly facing the wood pizza oven and the chefs expertly producing amazing pizzas in a matter of minutes. Seeing your pizza in the making makes you appreciate it all the more. The crust is perfectly crisp and charred, with the right amount of chewiness giving it more body. The topics are high quality and the right amount. Every pizza that I saw come out of the fire was perfection.\\nSide note - I was pleasantly surprised by the free-flow sparkling water for $2.50.\\n\\nWe had Melanzane and Prosciutto+buffalo mozzarella. Worth it! Will be coming back for more  \\u2763\\ufe0f\"},{\"rating\":5,\"text\":\"One of the better pizzas I\\u2019ve had in Singapore. The crust is crispy and chewy, the sauce on the pizza is on point, and the toppings are the perfect balance. Really likes my meal here, definitely coming back!\"},{\"rating\":5,\"text\":\"The food was absolutely amazing! Ingredients are very fresh and premium, elevating the whole dish. We ordered the prosciutto pizza and mentaiko pasta, tiramisu for dessert. Was just nice for two people, we were extremely happy and satisfied. Can\\u2019t wait to come back and try more things on the menu!\"},{\"rating\":5,\"text\":\"Love that the service staff is attentive and tries their best to accommodate our requests (like putting a candle on a starter instead of a dessert)!\\n\\nFood is impeccable for the value that Luka is giving! It\\u2019s rare to find a good union between 2 cuisines and all of the dishes ordered are hits! Fresh ingredients perfectly matched with good recipes and cooking skills!\\n\\nWill definitely be back for more food to make our tummies happy!\\n\\nThanks for the great evening!\"},{\"rating\":4,\"text\":\"Luka serves good Japanese- Italian fusion dishes. And you know it\\u2019s good when it\\u2019s patronised by many Japanese.\\n\\nThe combination worked well for the dishes we ordered. The Samurai pizza infused juicy teriyaki chicken with the pizza crust. We also liked the A4 Wagyu beef which melted in the mouth, and it was accompanied by an assortment of delicious vegetables. We also ordered a special of the day - Hokkaido snow crab risotto which was also great.\\n\\nGiving this restaurant 4 stars as while the overall food was good, it was on the pricier side, and somehow lacked the X factor in its dishes (and hence does not really warrant the high prices when there are more affordable restaurants which serve comparable or better food).\"}],\"serves_vegetarian_food\":true},{\"name\":\"Osteria Mozza\",\"reviews\":[{\"rating\":4,\"text\":\"Celebrated a friend\\u2019s birthday over here. Vibes were immaculate especially the outdoor-enclosed section.\\n\\nExcellent service and great food, but perhaps missing just that extra oomph that would bump this up to a 5-star rating, given the price point of the restaurant. Dishes were great but perhaps not enough to warrant a second visit.\\n\\nJust a side note that the restaurant doesn\\u2019t allow birthday cakes (bought from outside) to be eaten in the restaurant \\ud83e\\udd72\"},{\"rating\":3,\"text\":\"During my recent visit to Osteria Mozza, housed within a reputed 5-star hotel, my dining experience fell short of expectations. The ambiance was elegant, in line with the hotel's prestige. However, I found the food to be mediocre, lacking the anticipated finesse. The limited menu options didn't offer a diverse culinary experience, leaving much to be desired. Considering its affiliation with a luxury hotel, I had anticipated a higher standard in terms of food quality and variety. Regrettably, the dishes presented were underwhelming, failing to meet the expected level of sophistication and flavor. While the ambiance reflected sophistication, the gastronomic aspect left room for significant improvement. Enhancing the menu diversity and elevating the culinary standards could better align Osteria Mozza with the esteemed status of its hosting 5-star establishment. $$$+\"},{\"rating\":4,\"text\":\"Staff and service was excellent. Menu is not self explanatory. Perhaps a dual sided menu will help. Food was unique in its own right, but lacked the wow factor for its price point. The place however is very nice with the lush green outdoor setting.\"},{\"rating\":5,\"text\":\"I recently dined at Osteria Mozza and was thoroughly impressed with the overall experience. The service was truly exceptional, and the staff went above and beyond to make our evening memorable. The food was not only delicious but also showcased the culinary expertise of the kitchen.\\n\\nThe sommelier deserves special mention for providing fantastic wine recommendations that perfectly complemented our meal. The extensive selection of wines added a sophisticated touch to the dining experience, and having the sommelier on hand was a definite plus.\\n\\nOne standout moment was when the staff took a Polaroid picture of us and turned it into a handmade card for my friend, who was celebrating his birthday. This thoughtful gesture added a personal touch to the evening and made the celebration even more special.\\n\\nHowever, I must mention a slight drawback\\u2014the aroma from the open kitchen was noticeable. While it didn't overshadow the positives, it's worth noting for those sensitive to such matters.\\n\\nIn summary, Osteria Mozza is a top-notch restaurant that excels in service, culinary delights, and a remarkable wine collection. The minor inconvenience from the kitchen scent didn't significantly impact our overall enjoyment. I highly recommend Osteria Mozza for a delightful dining experience.\"},{\"rating\":5,\"text\":\"Most memorable anniversary dinner that I've had. Food is generally good. What stands out most is their service. It's impeccable. Do take note that they have strict dress code requirements. I was rejected initially due to not wearing covered shoes and have to wait till the customer who is using their loan shoes is done with his meal. Having said that, I'm still very satisfied with the overall experience. This shows how good the service was. Special mention to Kishore for his great service and for providing a Polaroid photo of my wife and I to remember the night. Will definitely be back!\"}],\"serves_vegetarian_food\":true},{\"name\":\"The Famous Kitchen\",\"reviews\":[{\"rating\":5,\"text\":\"A pleasant surprise!\\nFood taste good.\\nService is good.\\nCame on a Sunday for lunch, wasn't too crowded, atmosphere is good.\\nSuckling Pig comes at the right size. Not too big. Taste good.\\nPeking Duck is above average.\\nSignature blood cockle could be better.\\nService is good and attentive.\"},{\"rating\":5,\"text\":\"Food is great, service is decent (friendly staff), ambience definitely a plus - not crowded and table is widely spread (love it). Their Hakka tofu & orr nee are highly recommended, we like the fish head curry too. De-shelled prawn with wasabi & mayonnaise was on promotion, it\\u2019s not bad a choice too. Price is relatively higher though.\"},{\"rating\":5,\"text\":\"Every dish was excellent, but the star dish was definitely the fried fish. Have never had fish fried so perfectly - crisp on the outside, not oily, and still moist and tender on the inside with the freshness of the meat shining through!\"},{\"rating\":5,\"text\":\"Food was great though a bit pricey . Special thing abt this restaurant is the offering on wine spirit beer. Basically if you are a alcohol drinker , you will love this restaurant\\n\\nThey have a full set of alcohol (from whiskey to Japanese sake) which is quite rare in Singapore for a Chinese restaurant .\"},{\"rating\":5,\"text\":\"All dishes ordered were on spot. Nothing falls short of our expectations. They have monthly promotions for 50% off on selected dishes.  Service was prompt and attentive.  Reservation is highly recommended here.\"}],\"serves_vegetarian_food\":\"False\"},{\"name\":\"Pietrasanta The Italian Restaurant\",\"reviews\":[{\"rating\":5,\"text\":\"Tuscany style Italian cuisine, I think best Italian food in Singapore for this price, my favourite was the pesto pancakes. Service was also excellent, very attentive and they even suggested off menu items!\"},{\"rating\":5,\"text\":\"A quick meal in 40 min.\\nJust wanted to elaborate a bit more:\\nWe were going to attend our kids dance performance at University Cultural Centre that evening and was running a bit tight on time. The staff was really friendly and helpful when we shared our timing constraint. They got a table for us immediately. Came and took our orders. They also help us packed away of the pizza which we could not finish. The food was great.\"},{\"rating\":5,\"text\":\"A cozy Italian restaurant serves very nice Italian cuisine. Nice red wines and white wines selection.\\n\\nDuring our visit we order a pizza which u can request for half half so you can try 2 different taste of the pizza in the menu.\\n\\nMocktails, cocktails and if you are not a alcohol lover you can also choose sparkling water or non alcohol drink like coffee, tea or plain water.\"},{\"rating\":5,\"text\":\"My all tiem favourite Italian spot in Singapore! Super chill place that feels great for a Sunday afternoon lunch. Food is excellent and service is impeccable. Always start with the buratta and end your meal with the itramisu, it's just lovely. Would come more often if I didn't stay so far away!\"},{\"rating\":5,\"text\":\"Have not visited this restaurant for many years ever since they moved away from portsdown. Its still the best place to enjoy a good Italian meal \\ud83d\\udc4d\\n\\nThe place is located just outside office building on ground floor. Just $1 per entry during weekend.\\n\\nWe ordered our favourite pasta and burrata cheese salad(come with ham) + bread which brings us back memories when me and wife will still dating.\\n\\nThe potion of the cheese it's huge and enough for sharing at least 4pax. The squid ink seafood pasta come with alot if ingredients and already de-shelled.\\n\\nThe service is still exceptionally good! They changed our plate and cutlery after we finish the cheese (starter) and help to keep us comfortable and enjoy our meal.\"}],\"serves_vegetarian_food\":\"False\"},{\"name\":\"Artemis Grill & Sky Bar\",\"reviews\":[{\"rating\":5,\"text\":\"My husband and I celebrated our 30th wedding anniversary in December. We booked Artemis Grill for about 100+ of our guests and we were not disappointed. Adrian and Kai supported us in all preparations and made sure the evening went by smoothly and effortlessly. Our guests marveled at the food and cocktails. They also mentioned how all the staff were so attentive. My family had food tasting before hand so we knew what to expect. We were very pleased with how everything turned out. It was a beautiful evening in a great restaurant that had good food, attentive staff and we are very grateful. Thank you Artemis Grill for a memorable night and celebration.\"},{\"rating\":5,\"text\":\"I went with my guest of 4 pax for a business meeting dinner and was amazed by the food and ambience. Special thanks to Jim and Marion for their ultra warmth hospitality and wanted to specially thank them for maintaining excellent customer service experience throughout. I will definitely come back again.\"},{\"rating\":5,\"text\":\"Food was good, not quite exceptional but decent value for the quality and the view.\\n\\nA very friendly som and a great selection of wines by the glass.\\n\\nFood was all good, and they have no issue doing gluten-free for coeliacs.\\n\\nVenue is very nice.\\n\\n4 people, 3 entrees,  1 main + the steak for 3, 2 sides, 2 deserts, 6 glasses of wine ~$750.\"},{\"rating\":5,\"text\":\"My husband and I came here for our anniversary dinner. We had a window seat and the view is amazing. Our waters, still and sparkling, was $7 each. Had we known, we would have shared one type. They served complimentary bread with chili flakes and olive oil on the side. We ordered the scallop and hamachi tartare, Iberico pork loin and the beef tenderloin (don\\u2019t rmb which but it\\u2019s the $85~ one), along with a glass of Chardonnay and a cocktail. Our taste buds went to town and the meal was surprisingly filling! I think the price point is a little high so I wouldn\\u2019t come back too often. Our total came up to $278. It\\u2019s nice to try at least once and make sure you reserve a window seat. :)\"},{\"rating\":5,\"text\":\"My friend and I have been wanting to return since our first visit a few years ago. We came with more friends this time and it was as good as we remembered. The menu is different from then but the quality of the food is consistent! We loved almost everything. Not to mention, the attentiveness and warmth of the staff - really made the whole dining experience more enjoyable\"}],\"serves_vegetarian_food\":true},{\"name\":\"Rhubarb\",\"reviews\":[{\"rating\":5,\"text\":\"My private family\\u2019s lunch at this Michelin star restaurant was exceptional. The chef's creativity shone through in the dishes, which were full of flavor and presented beautifully. The service was attentive and professional, making the dining experience even more enjoyable. The atmosphere was private and stylish, with pleasant decorations and a perfect setting for dining. I would highly recommend this restaurant to anyone who enjoys fine dining.$$$$\"},{\"rating\":5,\"text\":\"Last night's dining experience at Rhubarb was amazing. The dishes were a brilliant blend of innovation and taste, showcasing Chef Paul's passion and expertise. Each plate was a visual feast, with flavors that surprised and delighted beyond expectation. The service team was the epitome of professionalism, exuding warmth and friendliness that made the cozy and elegant setting even more inviting. It is rare to find a restaurant where the ambiance harmonizes so well with the high standards of the culinary creations. This dinner wasn't just a meal; it was a memorable journey through exquisite tastes and textures. Rhubarb certainly deserves more than a mere one star. Thank you to Chef Paul and the entire staff for an unforgettable evening.\"},{\"rating\":3,\"text\":\"Let's start with the food. I ordered the 5-course omakase lunch\\n- Portions were just nice. Presentation was elegant, simple, yet pleasing to the eye. Bread basket was great. However, 3 out of 5 courses contained emulsion, which was one too many in my opinion.\\n- Many of the dishes were much too salty. The mushroom \\\"soup\\\" (it was foam, really) was interesting because it incorporated fermented ingredients, but it was so salty and pungent to the point of being inedible. The sauce that came with the Threadfin was also too salty, it had me and my party reaching for water after every bite.\\n- I will say though, the venison was excellent.\\n\\nService. Not good at all.\\n- Servers tried their best, but their explanation of the dishes was unclear as they were speaking much too quickly (but this is a minor point)\\n- The real gripe I have with this restaurant and the service I received was when I was not told that water was chargeable, and how much would be charged for each bottle. It was $16++ for each bottle of tap water. So coupled with the over-salted food, it was a recipe for disaster. We were charged close to $50 just for water. It is a shame and makes this restaurant fail in the service department completely. In retrospect, this is what ruined the entire experience for me, and made what was already an average lunch, terrible.  Michelin star be damned, you simply do not overcharge customers like that for bare necessities.\\n\\nAtmosphere\\n- I'm not sure how much of this I can attribute to the staff since the person I am praising is actually the interior designer.\\n- Beautiful skylight, and tasteful art on the walls. Open kitchen was also very visible for curious diners who want to watch Chef Paul at work.\"},{\"rating\":4,\"text\":\"Visited in Jul 2023\\n\\nThe last time I had visited Rhubarb was 4-5 years ago. So a revisit was a long time coming. Good food and great service as always. There are 3 options\\/dining experiences you can choose from. I went for the most comprehensive one - 3 starters, 1 main with chef\\u2019s premium ingredient and 1 dessert.\\n\\nWhile I can see how Rhubarb has been able to maintain its 1 star for so many years, I struggled a bit to find some key differentiating factor versus other French contemporary Michelin places. Good food nonetheless.\\n\\nService was really good. The dishes kept coming fast and I was done with my entire dinner in an hour.\\n\\nAll in all a very good dining place. If you haven\\u2019t been there, it is definitely worth going.\"},{\"rating\":5,\"text\":\"The 4-course lunch Omakase was very very satisfying, with interesting notes and flavours that I\\u2019m pleasantly surprised by. I also really enjoyed my chat with Joseph as a solo diner, so that my lunch was a little livelier. I had an absolutely lovely time and would return again.\"}],\"serves_vegetarian_food\":\"False\"}]"